//----------------------------------------------------------------------
// Файл IirFiltrInternal.h
// Версия от 26.02.2012
// ЗАО "ЭТМС", Зеленоград, Савостин Ю.М.
//----------------------------------------------------------------------
//		Класс реализует фильтры, расчёт коэффициентов которых
// реализован в библиотеке IPP 7.0. Это ФНЧ и ФВЧ для фильтров
// Баттерворта и Чебышева (фильтры Чебышева только в планах).
//		Необходимо соблюдать правило: на каждый сигнал - свой фильтр!!!
//----------------------------------------------------------------------
#pragma once
#include "afx.h"
#include <ippFiltr\CustomIirFiltr.h>
//----------------------------------------------------------------------
class CIirFiltrInternal : public CCustomIirFiltr
{
private:
	int order;
	bool autoOrder;
	float pTapsFloat[22];	// максимальный порядок 10 => размер
	double pTapsDouble[22];	//	массивов = 2 * (10 + 1) = 22
protected:

public:
	CIirFiltrInternal();
	virtual ~CIirFiltrInternal();

	// методы чтения/записи свойств -----------------
	void SetAutoOrder(bool bAutoOrder);

	// методы класса --------------------------------
	virtual bool InitFiltr(TypeFiltr type, float freq = 0.f);
	float PriorValue(float freq);
};
//----------------------------------------------------------------------

