//----------------------------------------------------------------------
// Файл IirFiltrSimple.h
// Версия от 26.02.2012
// ЗАО "ЭТМС", Зеленоград, Савостин Ю.М.
//----------------------------------------------------------------------
//		Класс реализует простые IIR фильтры, коэффициенты и порядок
// которых известны и заданы.
//		В классе используются функции библитеки IPP 7.0.
//		Необходимо соблюдать правило: на каждый сигнал - свой фильтр!!!
//----------------------------------------------------------------------
#pragma once
#include "afx.h"
#include <ippFiltr\CustomIirFiltr.h>
//----------------------------------------------------------------------
class CIirFiltrSimple : public CCustomIirFiltr
{
private:
	float pTaps[6];	// 2*(2+1) = 6, 2 - максимальный порядок

protected:

public:
	CIirFiltrSimple();
	virtual ~CIirFiltrSimple();

	// методы чтения/записи свойств -----------------

	// методы класса --------------------------------
	virtual bool InitFiltr(TypeFiltr type, float freq = 0.f);
};
//----------------------------------------------------------------------

