//------------------------------------------------------------------------------
#pragma once
//------------------------------------------------------------------------------
//	По примеру структуры TIME_ZONE_INFORMATION смещение задано в минутах!!!
//	TimeUTC = TimeZone + смещение.
//	UtcPlusX_XX - зона восточнее нулевого меридиана, смещение отрицательное.
//	UtcMinusX_XX - зона западнее нулевого меридиана, смещение положительное.
//	Пример: UtcPlus3_30 => смещение = 3 часа 30 минут на восток = -210 мин
//	Не путать с TimeZone из NuGet
//------------------------------------------------------------------------------
enum TimeZones
{
	Utc = 0,				/** UTC - глобальное время (UTC+0:00).*/
	UtcPlus1_00 = -60,		/** UTC+1:00*/
	UtcPlus2_00 = -120,		/** UTC+2:00*/
	UtcPlus3_00 = -180,		/** UTC+3:00*/
	UtcPlus3_30 = -210,		/** UTC+3:30*/
	UtcPlus4_00 = -240,		/** UTC+4:00*/
	UtcPlus5_00 = -300,		/** UTC+5:00*/
	UtcPlus5_30 = -330,		/** UTC+5:30*/
	UtcPlus6_00 = -360,		/** UTC+6:00*/
	UtcPlus7_00 = -420,		/** UTC+7:00*/
	UtcPlus8_00 = -480,		/** UTC+8:00*/
	UtcPlus9_00 = -540,		/** UTC+9:00*/
	UtcPlus9_30 = -570,		/** UTC+9:30*/
	UtcPlus10_00 = -600,		/** UTC+10:00*/
	UtcPlus11_00 = -660,		/** UTC+11:00*/
	UtcPlus12_00 = -720,		/** UTC+12:00*/
	UtcPlus13_00 = -780,		/** UTC+13:00*/
	UtcMinus1_00 = 60,		/** UTC-1:00*/
	UtcMinus2_00 = 120,		/** UTC-2:00*/
	UtcMinus3_00 = 180,		/** UTC-3:00*/
	UtcMinus4_00 = 240,		/** UTC-4:00*/
	UtcMinus5_00 = 300,		/** UTC-5:00*/
	UtcMinus6_00 = 360,		/** UTC-6:00*/
	UtcMinus7_00 = 420,		/** UTC-7:00*/
	UtcMinus8_00 = 480,		/** UTC-8:00*/
	UtcMinus9_00 = 540,		/** UTC-9:00*/
	UtcMinus10_00 = 600,	/** UTC-10:00*/
	UtcMinus11_00 = 660,	/** UTC-11:00*/
	UtcMinus12_00 = 720		/** UTC-12:00*/
};
//------------------------------------------------------------------------------