#ifndef ZET7XXX_DEVICE_TYPES_HEADER
#define ZET7XXX_DEVICE_TYPES_HEADER

/** Типы устройств */
typedef enum _ZET7XXX_DEVICE_TYPE
{
	UNKNOWN = 0,		/**< Неизвестное устройство */ 
	LOADER,				/**< Загрузчик */ 
	ZET_KEY,			/**< Ключ */ 
	ZET_7010,							//Тензостатик (RS485)
	ZET_7021,							//Термосопротивление (RS485)
	ZET_7120,							//Термопара (CAN)
	ZET_7174,							//Преобразователь интерфейсов USB -> CAN
	ZET_7172M,							//Преобразователь интерфесов  CAN -> Радио
	ZET_7070,							//Преобразователь интерфейсов USB -> RS485
	ZET_7140E,							//Акустическая эмиссия (CAN)
	ZET_7020,							//Термопара (RS485)
	ZET_7012I,							//Датчик давления (RS485)
	ZET_7140S,							//Вихретоковый преобразователь (CAN)
	ZET_7052,							//ADXL 3-компонентный акселерометр (RS485)
	ZET_7060,							//цифровой вход-выход (RS485)
	ZET_7060S,							//Управление шаговым двигателем
	ZET_7060G,							//Генератор сигнала
	ZET_7090,							//Генератор
	ZET_7051,							//Сейсмодатчик (RS485)
	ZET_SIMPLE_UART,					//простой загрузчик для последующих прошивок
	ZET_7110,							//Тензостатик (CAN)
	ZET_7152,							//ADXL 3-компонентный акселерометр (CAN)
	ZET_7111,							//Тензодинамик (CAN)
	ZET_7175,							// Синхронизация GPS через CAN
	ZET_7141S,							//Счётчик рдиоимпульсов (CAN)
	ZET_7176,							//Преобразователь интерфейсов Ethernet -> CAN
	ZET_7140R,							//Датчик кавитации (CAN)
	ZET_7153,							//Гидрофон (CAN)
	ZET_7060E,							//Энкодер (RS485)
	ZET_7160E,							//Энкодер (CAN)
	ZET_7160G,							//Цифровой генератор (CAN)
	ZET_7178, 							//CAN-LCD индикатор
	ZET_7151,							//Сейсмодатчик (CAN)
	ZET_7190,							//Аналоговый генератор (CAN)
	ZET_7190R,							//Аналоговый ПИД регулятор (CAN)
	ZET_7160,							//Цифровой порт (CAN)
	ZET_7080I,							//измерительное устройство для датчиков с токовым выходом
	ZET_7080V,							//измерительноеустройство для датчиков выходом по напряжению
	ZET_440,							//38 - ZET 440
	ZET_7180V,							//39 - Измерительное устройство для датчиков с выходом по напряжению (CAN)
	ZET_7180I,							//40 - Измерительное устройство для датчиков с токовым выходом (CAN)
	ZET_7121,							//41 - Термосопротивление (CAN)
	ZET_7112I,							//42 - Датчик давления (CAN)
	ZET_7172S,							//43 - Преобразователь интерфесов CAN -> Радио
	ZET_7150,							//44 - Сейсмодатчик (CAN)
	ZET_7050,							//45 - Сейсмодатчик (RS485)
	ZET_7076,							//46 - Преобразователь интерфейсов RS485 <-> Ethernet
	ZET_7012A,							//47 - Датчик абсолютного давления (RS485)
	ZET_7112A,							//48 - Датчик абсолютного давления (CAN)
	ZET_7061,							//49 - 2-канальный сухой контакт (RS485)
	ZET_7177,							//50 - Преобразователь интерфейсов CAN <-> GSM
	ZET_7160S,							//51 - Управление шаговым двигателем
	ZET_7161,							//52 - 2-канальный сухой контакт (CAN)
	ZET_7142,							//53 - Измеритель индуктивности на базе LDC1000 (CAN)
	ZET_7191,							//54 - Высокочастотный аналоговый генератор (CAN)
	ZET_7111L,							//55 - LVDT (CAN)
	ZET_7154,							//56 - Инклинометр на базе ADIS16209 (CAN)
	ZET_7192,							//57 - Аналоговый генератор (CAN)
	ZET_7054,							//58 - Инклинометр на базе ADIS16209
	ZET_7143,							//59 - Вихретоковый преобразователь (CAN)
	ZET_7152H,							//60 - ADXL 3-компонентный акселерометр (CAN)
	ZET_7152ST,							//61 - ADXL 3-компонентный акселерометр (CAN)
	ZET_7152SH,							//62 - ADXL 3-компонентный акселерометр (CAN)
	ZET_7173,							//63 - Регистратор CAN <-> USB <-> SD
	ZET_7010DS,							//64 - Тензометр со встроенными тензорезисторами
	ZET_7110DS,							//65 - Тензометр со встроенными тензорезисторами
	ZET_7123,							//66 - Измеритель относительной влажности (CAN)
	ZET_7141M,							//67 - Счётчик импульсов (CAN)
	ZET_7023,							//68 - Измеритель климатических параметров (RS485)
	ZET_7052ST,							//69 - ADXL 3-компонентный акселерометр (RS485)
	ZET_7052N,							//70 - ADXL 3-компонентный акселерометр (RS485)
	ZET_7152N,							//71 - ADXL 3-компонентный акселерометр (CAN)
	ZET_7152E,							//72 - ADXL 3-компонентный акселерометр (CAN)
	ZET_7155,							//73 - Однокомпонентный геофон (CAN)
	ZET_7154G,							//74 - Акселерометр на базе ADIS16209 (CAN)
	ZET_7156,							//75 - Трехкомпонентный геофон (CAN)
	ZET_7012BP15Ca,						//76 - Датчик абсолютного давления (RS485) с индикатором CC56
	ZET_7012BP15Ci,						//77 - Датчик избыточного давления (RS485) с индикатором CC56
	ZET_7012UP12a,						//78 - Датчик абсолютного давления (RS485) с индикатором SC26
	ZET_7012UP12i,						//79 - Датчик избыточного давления (RS485) с индикатором SC36
	ZET_7179,							//80 - BLE CAN
	ZET_7079,							//81 - BLE RS485
// Новые типы добавлять перед данной строкой
	ZET7XXX_DEVICE_TYPE_COUNT
} ZET7XXX_DEVICE_TYPE, *pZET7XXX_DEVICE_TYPE;

#define ZET7XXX_DEFINE_DEVICE_NAMES(name) \
static const TCHAR *name[ZET7XXX_DEVICE_TYPE_COUNT] = { \
	_T("UNKNOWN"), \
	_T("LOADER"), \
	_T("ZET Key"), \
	_T("ZET 7010"), \
	_T("ZET 7021"), \
	_T("ZET 7120"), \
	_T("ZET 7174"), \
	_T("ZET 7172-M"), \
	_T("ZET 7070"), \
	_T("ZET 7140-E"), \
	_T("ZET 7020"),  \
	_T("ZET 7012-I"), \
	_T("ZET 7140-S"), \
	_T("ZET 7052"), \
	_T("ZET 7060"), \
	_T("ZET 7060-S"), \
	_T("ZET 7060-G"), \
	_T("ZET 7090"), \
	_T("ZET 7051"), \
	_T("ZET SIMPLE_UART"), \
	_T("ZET 7110"), \
	_T("ZET 7152"), \
	_T("ZET 7111"), \
	_T("ZET 7175"), \
	_T("ZET 7141-S"), \
	_T("ZET 7176"), \
	_T("ZET 7140-R"), \
	_T("BC 314"), \
	_T("ZET 7060-E"), \
	_T("ZET 7160-E"), \
	_T("ZET 7160-G"), \
	_T("ZET 7178"), \
	_T("ZET 7151"), \
	_T("ZET 7190"), \
	_T("ZET 7190-R"), \
	_T("ZET 7160"), \
	_T("ZET 7080-I"), \
	_T("ZET 7080-V"), \
	_T("ZET 440"), \
	_T("ZET 7180-V"), \
	_T("ZET 7180-I"), \
	_T("ZET 7121"), \
	_T("ZET 7112-I"), \
	_T("ZET 7172-S"), \
	_T("ZET 7150"), \
	_T("ZET 7050"), \
	_T("ZET 7076"), \
	_T("ZET 7012-A"), \
	_T("ZET 7112-A"), \
	_T("ZET 7061"), \
	_T("ZET 7177"), \
	_T("ZET 7160-S"), \
	_T("ZET 7161"), \
	_T("ZET 7142"), \
	_T("ZET 7191"), \
	_T("ZET 7111-L"), \
	_T("ZET 7154"), \
	_T("ZET 7192"), \
	_T("ZET 7054"), \
	_T("ZET 7143"), \
	_T("ZET 7152-H"), \
	_T("ZET 7152-ST"), \
	_T("ZET 7152-SH"), \
	_T("ZET 7173"), \
	_T("ZET 7010-DS"), \
	_T("ZET 7110-DS"), \
	_T("ZET 7123"), \
	_T("ZET 7141-M"), \
	_T("ZET 7023"), \
	_T("ZET 7052-ST"), \
	_T("ZET 7052-N"), \
	_T("ZET 7152-N"), \
	_T("ZET 7152-E"), \
	_T("ZET 7155"), \
	_T("ZET 7154-G"), \
	_T("ZET 7156"), \
	_T("ZET 7012BP15Ca"), \
	_T("ZET 7012BP15Ci"), \
	_T("ZET 7012UP12a"), \
	_T("ZET 7012UP12i"), \
	_T("ZET 7179"), \
	_T("ZET 7079") \
}

#define ZET7XXX_DEFINE_DEVICE_DESCRIPTIONS(description) \
static const TCHAR *description[ZET7XXX_DEVICE_TYPE_COUNT] = { \
	_T("Неизвестное устройство"), \
	_T("LOADER"), \
	_T("ZETKey"), \
	_T("ZET 7010"), \
	_T("ZET 7021"), \
	_T("ZET 7120"), \
	_T("ZET 7174"), \
	_T("ZET 7172-M"), \
	_T("ZET 7070"), \
	_T("Датчик акустической эмиссии"), \
	_T("ZET 7020"),  \
	_T("ZET 7012-I"), \
	_T("ZET 7140-S"), \
	_T("ZET 7052"), \
	_T("ZET 7060"), \
	_T("ZET 7060-S"), \
	_T("ZET 7060-G"), \
	_T("ZET 7090"), \
	_T("ZET 7051"), \
	_T("ZET SIMPLE_UART"), \
	_T("ZET 7110"), \
	_T("ZET 7152"), \
	_T("ZET 7111"), \
	_T("ZET 7175"), \
	_T("ZET 7141-S"), \
	_T("ZET 7176"), \
	_T("ZET 7140-R"), \
	_T("BC 314"), \
	_T("ZET 7060-E"), \
	_T("ZET 7160-E"), \
	_T("ZET 7160-G"), \
	_T("ZET 7178"), \
	_T("ZET 7151"), \
	_T("ZET 7190"), \
	_T("ZET 7190-R"), \
	_T("ZET 7160"), \
	_T("ZET 7080-I"), \
	_T("ZET 7080-V"), \
	_T("ZET 440"), \
	_T("ZET 7180-V"), \
	_T("ZET 7180-I"), \
	_T("ZET 7121"), \
	_T("ZET 7112-I"), \
	_T("ZET 7172-S"), \
	_T("ZET 7150"), \
	_T("ZET 7050"), \
	_T("ZET 7076"), \
	_T("ZET 7012-A"), \
	_T("ZET 7112-A"), \
	_T("ZET 7061"), \
	_T("ZET 7177"), \
	_T("ZET 7160-S"), \
	_T("ZET 7161"), \
	_T("ZET 7142"), \
	_T("Высокочастотный аналоговый генератор"), \
	_T("ZET 7111-L"), \
	_T("ZET 7154"), \
	_T("ZET 7192"), \
	_T("ZET 7054"), \
	_T("ZET 7143"), \
	_T("ZET 7152-H"), \
	_T("ZET 7152-ST"), \
	_T("ZET 7152-SH"), \
	_T("ZET 7173"), \
	_T("ZET 7010-DS"), \
	_T("ZET 7110-DS"), \
	_T("ZET 7123"), \
	_T("ZET 7141-M"), \
	_T("ZET 7023"), \
	_T("ZET 7052-ST"), \
	_T("ZET 7052-N"), \
	_T("ZET 7152-N"), \
	_T("ZET 7152-E"), \
	_T("Однокомпонентный геофон"), \
	_T("ZET 7154-G"), \
	_T("ZET 7156"), \
	_T("ZET 7012BP15Ca"), \
	_T("ZET 7012BP15Ci"), \
	_T("ZET 7012UP12a"), \
	_T("ZET 7012UP12i"), \
	_T("ZET 7179"), \
	_T("ZET 7079") \
}

#endif
