//----------------------------------------------------------------------
// Файл Option.h
// Версия от 06.06.2012
// ЗАО "ЭТМС", Зеленоград, Антонов А.Ю.
//----------------------------------------------------------------------
// Класс для чтения опций устройств
//----------------------------------------------------------------------
#pragma once

class COption
{
public:
	COption();
	virtual ~COption();

	CString GetSoftware(long lMask);
	CString GetHardware(long lMask);
};
//----------------------------------------------------------------------

