//------------------------------------------------------------------------------
// IScreenBuffering.h : »нтерфейс дл€ класс, заполн€ющего буфер текущим изображением программы.
//------------------------------------------------------------------------------
#pragma once

class IScreenBuffering
{
public:

	virtual HWND GetWindow() = 0;
	////////////////////////////////////////////////////////////////////////////
	///// ћетод, возвращающий текущий размер изображени€ программы.
	////////////////////////////////////////////////////////////////////////////
	virtual SIZE& GetBufferSize() = 0;

	//////////////////////////////////////////////////////////////////////////
	/// ћетод, заполн€ющий переданный буфер изображением программы.
	/// ref buffer: буфер, принимаюший изображение.
	/// out size: размер изображени€.
	//////////////////////////////////////////////////////////////////////////
	virtual bool GetImageBuffer(CByteArray *buffer, SIZE &size, bool force = false) = 0;
};