//------------------------------------------------------------------------------
// FunctionForAll.h
//------------------------------------------------------------------------------
#pragma once
//------------------------------------------------------------------------------
#include "afx.h"
#include <DefineWM.h>
//------------------------------------------------------------------------------
// ѕосылка Zet-панели сообщени€ об открытии/закрытии окна
//
void SendOpen(const HWND hWndPanel, const HWND hWndWin, const bool bOpen);
//------------------------------------------------------------------------------
// ‘ункци€, реализующа€ ограничение минимальных размеров окна.
// ѕредназначена дл€ использовани€ в обработчике сообщени€ WM_SIZING.
// pRect - новые размеры окна;
// pRectOld - прежние размеры окна;
// cx_min - минимальна€ ширинв окна (Width_Min);
// cy_min - миинимальна€ высота окна (Height_Min).
//
void _OnSizing(LPRECT pRect, LPRECT pRectOld, const long cx_min, const long cy_min);
//------------------------------------------------------------------------------