// Сформированные компьютером классы оболочки IDispatch, созданные при помощи Microsoft Visual C++

// ПРИМЕЧАНИЕ. Не изменяйте содержимое этого класса. Если этот класс будет повторно создан при помощи
//  Microsoft Visual C++, ваши изменения будут перезаписаны.


#include "stdafx.h"
#include "CDUnit.h"

/////////////////////////////////////////////////////////////////////////////
// CDUnit

IMPLEMENT_DYNCREATE(CDUnit, CWnd)

/////////////////////////////////////////////////////////////////////////////
// свойства CDUnit

/////////////////////////////////////////////////////////////////////////////
// операции CDUnit
