// Сформированные компьютером классы оболочки IDispatch, созданные при помощи Microsoft Visual C++

// ПРИМЕЧАНИЕ. Не изменяйте содержимое этого класса. Если этот класс будет повторно создан при помощи
//  Microsoft Visual C++, ваши изменения будут перезаписаны.


#include "stdafx.h"
#include "CDUnitCln.h"

/////////////////////////////////////////////////////////////////////////////
// CDUnitCln

IMPLEMENT_DYNCREATE(CDUnitCln, CWnd)

/////////////////////////////////////////////////////////////////////////////
// свойства CDUnitCln

/////////////////////////////////////////////////////////////////////////////
// операции CDUnitCln
