// Сформированные компьютером классы оболочки IDispatch, созданные при помощи Microsoft Visual C++

// ПРИМЕЧАНИЕ. Не изменяйте содержимое этого класса. Если этот класс будет повторно создан при помощи
//  Microsoft Visual C++, ваши изменения будут перезаписаны.


#include "stdafx.h"
#include "CDUnitSrv.h"

/////////////////////////////////////////////////////////////////////////////
// CDUnitSrv

IMPLEMENT_DYNCREATE(CDUnitSrv, CWnd)

/////////////////////////////////////////////////////////////////////////////
// свойства CDUnitSrv

/////////////////////////////////////////////////////////////////////////////
// операции CDUnitSrv
