//------------------------------------------------------------------------------
//	Файл RotateSystem_2D.h
//	Версия от 28.11.2012
//	Зеленоград, ЗАО "ЭТМС", Савостин Ю.М.
//------------------------------------------------------------------------------
// Класс предназначен для поворота системы координат X-Y
//------------------------------------------------------------------------------
#pragma once
//------------------------------------------------------------------------------
#include "afx.h"
#define _USE_MATH_DEFINES
#include "math.h"
//------------------------------------------------------------------------------
class CRotateSystem_2D
{
private:
	float m_BearingY;		// истинный пеленг оси Y, угол от 0 до 360 град.
	float m_cos, m_sin;
	bool m_bNotZero;
	// приватные функции класса ------------------------------
public:
	CRotateSystem_2D();
	virtual ~CRotateSystem_2D(){}

	// функции свойств
	float GetBearingY() { return m_BearingY; }
	bool SetBearingY(float val);

	// функции класса
	bool Rotate_32f_I(float *pX, float *pY, long num);
};
//------------------------------------------------------------------------------