//----------------------------------------------------------------------
// Файл IirFiltrSimpleDouble.h
// Версия от 03.05.2012
// ЗАО "ЭТМС", Зеленоград, Савостин Ю.М.
//----------------------------------------------------------------------
//		Класс реализует простые IIR фильтры, коэффициенты и порядок
// которых известны и заданы.
//		В классе используются функции библитеки IPP 7.0.
//		Необходимо соблюдать правило: на каждый сигнал - свой фильтр!!!
//----------------------------------------------------------------------
#pragma once
#include "afx.h"
#include <ippFiltrDouble\CustomIirFiltrDouble.h>
//----------------------------------------------------------------------
class CIirFiltrSimpleDouble : public CCustomIirFiltrDouble
{
private:
	double pTaps[6];	// 2*(2+1) = 6, 2 - максимальный порядок

protected:

public:
	CIirFiltrSimpleDouble();
	virtual ~CIirFiltrSimpleDouble();

	// методы чтения/записи свойств -----------------

	// методы класса --------------------------------
	virtual bool InitFiltr(TypeFiltr type, double freq = 0.);
};
//----------------------------------------------------------------------

