// Сформированные компьютером классы оболочки IDispatch, созданные при помощи Microsoft Visual C++

// ПРИМЕЧАНИЕ. Не изменяйте содержимое этого класса. Если этот класс будет повторно создан при помощи
//  Microsoft Visual C++, ваши изменения будут перезаписаны.


#include "stdafx.h"
#include "chanselector1.h"

/////////////////////////////////////////////////////////////////////////////
// CChanselector1

IMPLEMENT_DYNCREATE(CChanselector1, CWnd)

/////////////////////////////////////////////////////////////////////////////
// свойства CChanselector1

/////////////////////////////////////////////////////////////////////////////
// операции CChanselector1
