// Сформированные компьютером классы оболочки IDispatch, созданные при помощи Microsoft Visual C++

// ПРИМЕЧАНИЕ. Не изменяйте содержимое этого класса. Если этот класс будет повторно создан при помощи
//  Microsoft Visual C++, ваши изменения будут перезаписаны.


#include "stdafx.h"
#include "colscalectrl1.h"

/////////////////////////////////////////////////////////////////////////////
// CColscalectrl1

IMPLEMENT_DYNCREATE(CColscalectrl1, CWnd)

/////////////////////////////////////////////////////////////////////////////
// свойства CColscalectrl1

/////////////////////////////////////////////////////////////////////////////
// операции CColscalectrl1
