// Сформированные компьютером классы оболочки IDispatch, созданные при помощи Microsoft Visual C++

// ПРИМЕЧАНИЕ. Не изменяйте содержимое этого класса. Если этот класс будет повторно создан при помощи
//  Microsoft Visual C++, ваши изменения будут перезаписаны.


#include "stdafx.h"
#include "gdipluscomboboxctrl1.h"

/////////////////////////////////////////////////////////////////////////////
// CGdipluscomboboxctrl1

IMPLEMENT_DYNCREATE(CGdipluscomboboxctrl1, CWnd)

/////////////////////////////////////////////////////////////////////////////
// свойства CGdipluscomboboxctrl1

/////////////////////////////////////////////////////////////////////////////
// операции CGdipluscomboboxctrl1
