// Сформированные компьютером классы оболочки IDispatch, созданные при помощи Microsoft Visual C++

// ПРИМЕЧАНИЕ. Не изменяйте содержимое этого класса. Если этот класс будет повторно создан при помощи
//  Microsoft Visual C++, ваши изменения будут перезаписаны.


#include "stdafx.h"
#include "grammaglctrl1.h"

/////////////////////////////////////////////////////////////////////////////
// CGrammaglctrl1

IMPLEMENT_DYNCREATE(CGrammaglctrl1, CWnd)

/////////////////////////////////////////////////////////////////////////////
// свойства CGrammaglctrl1

/////////////////////////////////////////////////////////////////////////////
// операции CGrammaglctrl1
