// Сформированные компьютером классы оболочки IDispatch, созданные при помощи Microsoft Visual C++

// ПРИМЕЧАНИЕ. Не изменяйте содержимое этого класса. Если этот класс будет повторно создан при помощи
//  Microsoft Visual C++, ваши изменения будут перезаписаны.


#include "stdafx.h"
#include "grammactrl1.h"

/////////////////////////////////////////////////////////////////////////////
// CGrammactrl1

IMPLEMENT_DYNCREATE(CGrammactrl1, CWnd)

/////////////////////////////////////////////////////////////////////////////
// свойства CGrammactrl1

/////////////////////////////////////////////////////////////////////////////
// операции CGrammactrl1
