// Сформированные компьютером классы оболочки IDispatch, созданные при помощи Microsoft Visual C++

// ПРИМЕЧАНИЕ. Не изменяйте содержимое этого класса.  Если этот класс будет повторно создан при помощи
//  Microsoft Visual C++, ваши изменения будут перезаписаны.


#include "stdafx.h"
#include "HorizontalSlider.h"

/////////////////////////////////////////////////////////////////////////////
// CHorizontalSlider

IMPLEMENT_DYNCREATE(CHorizontalSlider, CWnd)

/////////////////////////////////////////////////////////////////////////////
// свойства CHorizontalSlider

/////////////////////////////////////////////////////////////////////////////
// операции CHorizontalSlider
