// Сформированные компьютером классы оболочки IDispatch, созданные при помощи Microsoft Visual C++

// ПРИМЕЧАНИЕ. Не изменяйте содержимое этого класса. Если этот класс будет повторно создан при помощи
//  Microsoft Visual C++, ваши изменения будут перезаписаны.


#include "stdafx.h"
#include "plotterxyctrl1.h"

/////////////////////////////////////////////////////////////////////////////
// CPlotterxyctrl1

IMPLEMENT_DYNCREATE(CPlotterxyctrl1, CWnd)

/////////////////////////////////////////////////////////////////////////////
// свойства CPlotterxyctrl2

/////////////////////////////////////////////////////////////////////////////
// операции CPlotterxyctrl2
