// Сформированные компьютером классы оболочки IDispatch, созданные при помощи Microsoft Visual C++

// ПРИМЕЧАНИЕ. Не изменяйте содержимое этого класса. Если этот класс будет повторно создан при помощи
//  Microsoft Visual C++, ваши изменения будут перезаписаны.


#include "stdafx.h"
#include "polarctrl1.h"

/////////////////////////////////////////////////////////////////////////////
// CPolarctrl1

IMPLEMENT_DYNCREATE(CPolarctrl1, CWnd)

/////////////////////////////////////////////////////////////////////////////
// свойства CPolarctrl1

/////////////////////////////////////////////////////////////////////////////
// операции CPolarctrl1
