// Сформированные компьютером классы оболочки IDispatch, созданные при помощи Microsoft Visual C++

// ПРИМЕЧАНИЕ. Не изменяйте содержимое этого класса. Если этот класс будет повторно создан при помощи
//  Microsoft Visual C++, ваши изменения будут перезаписаны.


#include "stdafx.h"
#include "textdispctrl1.h"

/////////////////////////////////////////////////////////////////////////////
// CTextdispctrl1

IMPLEMENT_DYNCREATE(CTextdispctrl1, CWnd)

/////////////////////////////////////////////////////////////////////////////
// свойства CTextdispctrl1

/////////////////////////////////////////////////////////////////////////////
// операции CTextdispctrl1
