// Сформированные компьютером классы оболочки IDispatch, созданные при помощи Microsoft Visual C++

// ПРИМЕЧАНИЕ. Не изменяйте содержимое этого класса. Если этот класс будет повторно создан при помощи
//  Microsoft Visual C++, ваши изменения будут перезаписаны.


#include "stdafx.h"
#include "zbuttonctrl1.h"

/////////////////////////////////////////////////////////////////////////////
// CZbuttonctrl1

IMPLEMENT_DYNCREATE(CZbuttonctrl1, CWnd)

/////////////////////////////////////////////////////////////////////////////
// свойства CZbuttonctrl1

/////////////////////////////////////////////////////////////////////////////
// операции CZbuttonctrl1
