// Сформированные компьютером классы оболочки IDispatch, созданные при помощи Microsoft Visual C++

// ПРИМЕЧАНИЕ. Не изменяйте содержимое этого класса. Если этот класс будет повторно создан при помощи
//  Microsoft Visual C++, ваши изменения будут перезаписаны.


#include "stdafx.h"
#include "zregulatorctrl1.h"

/////////////////////////////////////////////////////////////////////////////
// CZregulatorctrl1

IMPLEMENT_DYNCREATE(CZregulatorctrl1, CWnd)

/////////////////////////////////////////////////////////////////////////////
// свойства CZregulatorctrl1

/////////////////////////////////////////////////////////////////////////////
// операции CZregulatorctrl1
