#pragma once
#include <vector>
//*************************************************************************************************
#define USE_DEFAULT -1
//*************************************************************************************************
class CGridDigits
{
public://******************************************************************************************
	CGridDigits();
	//				Ќачальное значение  /        онечное значение  /  Ўирина между ними в пиксел€х
	CGridDigits(_In_ const double &FirstVal, _In_ const double &LastVal, 
				_In_ const int &WidthInPix, _In_opt_ const int &MaxColumnWidth = USE_DEFAULT);
	virtual ~CGridDigits();
	//*********************************************************************************************
	std::vector<long double> m_DigitsList;			// список значений
	std::vector<long double> m_IntermediateDigits;	// список промежуточных значений
	CString m_Format;								// формат которым задаетс€ число
public://******************************************************************************************	
	//				Ќачальное значение  /        онечное значение 
	void CalcDigits(_In_ double FirstVal, _In_ double LastVal, 
	//				Ўирина между ними в пиксел€х / максимальна€ ширина колонки
					_In_ int WidthInPix, _In_opt_ const int &MaxColumnWidth = USE_DEFAULT);
protected://***************************************************************************************
};	//*********************************************************************************************